#include <iostream>
#include <conio.h>

using namespace std;

int main()
{
	//만들라고 하지 않았지만 맵
	string Map[10][10] = 
	{
		{".",".",".",".",".",".",".",".",".","."},
		{".",".",".",".",".",".",".",".",".","."},
		{".",".","*",".",".",".",".",".",".","."},
		{".",".",".",".",".",".",".",".",".","."},
		{".",".",".",".",".",".",".",".",".","."},
		{".",".",".",".",".",".",".",".",".","."},
		{".",".",".",".",".",".",".",".",".","."},
		{".",".",".",".",".",".",".",".",".","."},
		{".",".",".",".",".",".",".",".",".","."},
		{".",".",".",".",".",".",".",".",".","."},
	};
	//키입력과 처음 시작 위치
	string Key = "";
	int Hor = 2;
	int Ver = 2;

	//처음 시작 시 화면 생성 
	for (int i = 0; i < 10; i++) {
		for (int j = 0; j < 10; j++) {
			cout << Map[i][j];
		}
		cout << endl;
	}

	//키 입력 분기
	while (1) {
		cin >> Key;
		if ( Key == "w") {
			Map[Ver][Hor] = ".";
			Map[Ver - 1][Hor] = "*";
			Ver = Ver - 1;
		}
		else if (Key == "a") {
			Map[Ver][Hor] = ".";
			Map[Ver][Hor - 1] = "*";
			Hor = Hor - 1;

		}
		else if (Key == "s") {
			Map[Ver][Hor] = ".";
			Map[Ver + 1][Hor] = "*";
			Ver = Ver + 1;
		}
		else if (Key == "d") {
			Map[Ver][Hor] = ".";
			Map[Ver][Hor + 1] = "*";
			Hor = Hor + 1;
		};
		
		//입력 받을 때마다 화면 출력
		for (int i = 0; i < 10; i++) {
			for (int j = 0; j < 10; j++) {
				cout << Map[i][j];
			}
			cout << endl;
		}
	};
}